Aplication/xml/proposta.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.webservice.afc.app.bsbr.altec.com/">
	<soapenv:Header>
		<token:security xmlns:token="http://santander-fo">
			<username xmlns="">madeireira</username>
			<key xmlns="">89564B999337A671</key>
			<cnpj xmlns="">03875890000173</cnpj>
			<codigoGrupoCanal xmlns="">0008.001</codigoGrupoCanal>
			<numeroIntermediario xmlns="">198710</numeroIntermediario>
		</token:security>
	</soapenv:Header>
	<soapenv:Body>
		<impl:enviaPropostaFinanciamentoVeiculoPasso1Inicio xmlns:impl="http://santander-fo">
			<chamada xmlns="">
				<codigoFormaPagamento xmlns="">CA</codigoFormaPagamento>
				<dataEntregaBem xmlns="">26/05/2014</dataEntregaBem>
				<codigoTipoMoeda xmlns="">PRE</codigoTipoMoeda>
				<nomeVendedor xmlns="">Akarlos Vasconcelos</nomeVendedor>
				<numeroIdProduto xmlns="">0206</numeroIdProduto>
				<numeroQuantidadePrestacoes xmlns="">36</numeroQuantidadePrestacoes>
				<codigoModalidade xmlns="">P</codigoModalidade>
				<numeroTabelaFinanciamento xmlns="">55785</numeroTabelaFinanciamento>
				<numeroVendedor xmlns="">13</numeroVendedor>
				<indicadorTac xmlns="">N</indicadorTac>
				<isencaoTC xmlns="">S</isencaoTC>
				<isencaoTAB xmlns="">N</isencaoTAB>
				<textoControleLoja xmlns="">teste do sistema..</textoControleLoja>
				<textoObsLoja xmlns="">Teste do sistema...</textoObsLoja>
				<valorBem xmlns="">20.000,00</valorBem>
				<valorEntrada xmlns="">10.000,00</valorEntrada>
				<valorFinanciamento xmlns="">10.000,00</valorFinanciamento>
				<valorPrestacao xmlns="">277,80</valorPrestacao>
				<dataVencimento1 xmlns="">25/06/2014</dataVencimento1>
				<numeroIntermediario xmlns="">198710</numeroIntermediario>
			</chamada>
		</impl:enviaPropostaFinanciamentoVeiculoPasso1Inicio>
	</soapenv:Body>
</soapenv:Envelope>
<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<dlwmin:enviaPropostaFinanciamentoVeiculoPasso1InicioResponse xmlns:dlwmin="http://impl.webservice.afc.app.bsbr.altec.com/">
			<inserePropostaResponse>
				<codigoErro></codigoErro>
				<codigoRetorno>00</codigoRetorno>
				<descricaoErro></descricaoErro>
				<numeroPropostaAdp>0043204552</numeroPropostaAdp>
			</inserePropostaResponse>
		</dlwmin:enviaPropostaFinanciamentoVeiculoPasso1InicioResponse>
	</soapenv:Body>
</soapenv:Envelope>
<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.webservice.afc.app.bsbr.altec.com/">
	<soapenv:Header>
		<token:security xmlns:token="http://santander-fo">
			<username xmlns="">madeireira</username>
			<key xmlns="">89564B999337A671</key>
			<cnpj xmlns="">03875890000173</cnpj>
			<codigoGrupoCanal xmlns="">0008.001</codigoGrupoCanal>
			<numeroIntermediario xmlns="">198710</numeroIntermediario>
		</token:security>
	</soapenv:Header>
	<soapenv:Body>
		<impl:enviaPropostaFinanciamentoVeiculoPasso2DadosPessoais xmlns:impl="http://santander-fo">
			<chamada xmlns="">
				<numeroTipoVinculoPart xmlns="">1</numeroTipoVinculoPart>
				<numeroPropostaAdp xmlns="">0043204552</numeroPropostaAdp>
				<codigoDocumento xmlns="">20075043747</codigoDocumento>
				<codigoEstadoNaturalidade xmlns="">CE</codigoEstadoNaturalidade>
				<codigoEstadoOrgaoEmissor xmlns="">CE</codigoEstadoOrgaoEmissor>
				<codigoNacionalidade xmlns="">0</codigoNacionalidade>
				<codigoPaisDocumento xmlns="">BR</codigoPaisDocumento>
				<codigoSedePropria xmlns=""></codigoSedePropria>
				<codigoSexo xmlns="">M</codigoSexo>
				<codigoTipoPessoa xmlns="">F</codigoTipoPessoa>
				<dataAdmissao xmlns="">02/02/2012</dataAdmissao>
				<dataEmissaoDocumento xmlns="">12/04/2010</dataEmissaoDocumento>
				<dataNascimento xmlns="">13/06/1994</dataNascimento>
				<descricaoNaturalidade xmlns="">FORTALEZA</descricaoNaturalidade>
				<descricaoProfissao xmlns="">PROGRAMADOR</descricaoProfissao>
				<nomeCompleto xmlns="">Bruno Araujo Freitas</nomeCompleto>
				<nomeEmpresa xmlns="">Bruno Araujo Freitas</nomeEmpresa>
				<nomeOrgaoEmissor xmlns="">ssp</nomeOrgaoEmissor>
				<nomeMae xmlns="">Rita Francilene Araujo</nomeMae>
				<nomePai xmlns="">Francisco De Assis Freitas</nomePai>
				<numeroCnpjEmpresa xmlns="">05754853378</numeroCnpjEmpresa>
				<numeroComprovanteRenda xmlns="">02</numeroComprovanteRenda>
				<numeroCpfCnpj xmlns="">05754853378</numeroCpfCnpj>
				<numeroDependentes xmlns="">0</numeroDependentes>
				<numeroEstadoCivil xmlns="">1</numeroEstadoCivil>
				<numeroProfissao xmlns="">70</numeroProfissao>
				<numeroRenda xmlns="">1</numeroRenda>
				<numeroTipoDocumento xmlns="">01</numeroTipoDocumento>
				<valorOutrasRendas xmlns="">0</valorOutrasRendas>
				<valorPatrimonio xmlns="">10.000,00</valorPatrimonio>
				<valorRendaMensal xmlns="">00.930,00</valorRendaMensal>
				<numeroInstrucao xmlns="">01</numeroInstrucao>
				<indicativoDeficienteFisico xmlns="">N</indicativoDeficienteFisico>
				<numeroOcupacao xmlns="">01</numeroOcupacao>
			</chamada>
		</impl:enviaPropostaFinanciamentoVeiculoPasso2DadosPessoais>
	</soapenv:Body>
</soapenv:Envelope>
<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<dlwmin:enviaPropostaFinanciamentoVeiculoPasso2DadosPessoaisResponse xmlns:dlwmin="http://impl.webservice.afc.app.bsbr.altec.com/">
			<dadosPessoaisResponse>
				<codigoErro></codigoErro>
				<codigoRetorno>00</codigoRetorno>
				<descricaoErro></descricaoErro>
				<dadosPessoais>
					<numeroInternoCliente>00000001</numeroInternoCliente>
				</dadosPessoais>
			</dadosPessoaisResponse>
		</dlwmin:enviaPropostaFinanciamentoVeiculoPasso2DadosPessoaisResponse>
	</soapenv:Body>
</soapenv:Envelope>
<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.webservice.afc.app.bsbr.altec.com/">
	<soapenv:Header>
		<token:security xmlns:token="http://santander-fo">
			<username xmlns="">madeireira</username>
			<key xmlns="">89564B999337A671</key>
			<cnpj xmlns="">03875890000173</cnpj>
			<codigoGrupoCanal xmlns="">0008.001</codigoGrupoCanal>
			<numeroIntermediario xmlns="">198710</numeroIntermediario>
		</token:security>
	</soapenv:Header>
	<soapenv:Body>
		<impl:enviaPropostaFinanciamentoVeiculoPasso3Endereco xmlns:impl="http://santander-fo">
			<chamada xmlns="">
				<numeroPropostaAdp xmlns="">0043204552</numeroPropostaAdp>
				<numeroClienteInterno xmlns="">00000001</numeroClienteInterno>
				<codigoEnderecoCorrespondencia xmlns="">R</codigoEnderecoCorrespondencia>
				<codigoPaisComercial xmlns="">BR</codigoPaisComercial>
				<codigoPaisResidencial xmlns="">BR</codigoPaisResidencial>
				<codigoSiglaUfComercial xmlns="">CE</codigoSiglaUfComercial>
				<codigoSiglaUfResidencial xmlns="">CE</codigoSiglaUfResidencial>
				<dataAnoResideDesde xmlns="">2005</dataAnoResideDesde>
				<dataMesResideDesde xmlns="">02</dataMesResideDesde>
				<descricaoComplementoEndComercial xmlns=""></descricaoComplementoEndComercial>
				<descricaoComplementoResidencia xmlns="">Proximo a cagece</descricaoComplementoResidencia>
				<descricaoEnderecoComercial xmlns="">rodovia 402</descricaoEnderecoComercial>
				<descricaoEnderecoResidencia xmlns="">Rua Padre Cicero</descricaoEnderecoResidencia>
				<descricaoEnderecoEmail xmlns="">bruno_araujo@hotmail.com</descricaoEnderecoEmail>
				<descricaoTelComercial xmlns="">(88) 3664-18</descricaoTelComercial>
				<descricaotelResidencial xmlns="">(88) 3664-18</descricaotelResidencial>
				<nomeBairroComercial xmlns="">ALEMAES</nomeBairroComercial>
				<nomeBairroResidencial xmlns="">CENTRO</nomeBairroResidencial>
				<nomeCidadeComercial xmlns="">MARCO</nomeCidadeComercial>
				<nomeCidadeResidencial xmlns="">MARCO</nomeCidadeResidencial>
				<numeroCepComercial xmlns="">62.560-000</numeroCepComercial>
				<numeroCepResidencial xmlns="">62.560-000</numeroCepResidencial>
				<numeroDddCel xmlns="">88</numeroDddCel>
				<numeroDddResidencial xmlns="">88</numeroDddResidencial>
				<numeroDddTelComercial xmlns="">88</numeroDddTelComercial>
				<numeroEnderecoComercial xmlns="">0000</numeroEnderecoComercial>
				<numeroResidencial xmlns="">0019</numeroResidencial>
				<numeroTipoResidencia xmlns="">1</numeroTipoResidencia>
				<numeroTipoTelefResiden xmlns="">2</numeroTipoTelefResiden>
			</chamada>
		</impl:enviaPropostaFinanciamentoVeiculoPasso3Endereco>
	</soapenv:Body>
</soapenv:Envelope>
<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<dlwmin:enviaPropostaFinanciamentoVeiculoPasso3EnderecoResponse xmlns:dlwmin="http://impl.webservice.afc.app.bsbr.altec.com/">
			<insereEnderecoResponse>
				<codigoErro></codigoErro>
				<codigoRetorno>00</codigoRetorno>
				<descricaoErro></descricaoErro>
			</insereEnderecoResponse>
		</dlwmin:enviaPropostaFinanciamentoVeiculoPasso3EnderecoResponse>
	</soapenv:Body>
</soapenv:Envelope>
<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.webservice.afc.app.bsbr.altec.com/">
	<soapenv:Header>
		<token:security xmlns:token="http://santander-fo">
			<username xmlns="">madeireira</username>
			<key xmlns="">89564B999337A671</key>
			<cnpj xmlns="">03875890000173</cnpj>
			<codigoGrupoCanal xmlns="">0008.001</codigoGrupoCanal>
			<numeroIntermediario xmlns="">198710</numeroIntermediario>
		</token:security>
	</soapenv:Header>
	<soapenv:Body>
		<impl:enviaPropostaFinanciamentoVeiculoPasso4Referencias xmlns:impl="http://santander-fo">
			<chamada xmlns="">
				<numeroPropostaAdp xmlns="">0043204552</numeroPropostaAdp>
				<codigoDigitoAgencia xmlns="">0</codigoDigitoAgencia>
				<codigoDigitoContaCorrente xmlns="">4</codigoDigitoContaCorrente>
				<codigoTipoContaBancaria xmlns="">C</codigoTipoContaBancaria>
				<descricaoTelefoneBanco xmlns="">(88)3664-1212</descricaoTelefoneBanco>
				<descricaoTelefoneRefer1 xmlns="">(88) 9735-3539</descricaoTelefoneRefer1>
				<descricaoTelefoneRefer2 xmlns="">(88) 9735-3539</descricaoTelefoneRefer2>
				<nomeRefer1 xmlns="">Akarlos Vasconcelos</nomeRefer1>
				<nomeRefer2 xmlns="">Jalen Fabio</nomeRefer2>
				<numeroAgencia xmlns="">2273</numeroAgencia>
				<numeroAnoClienteDesde xmlns="">2012</numeroAnoClienteDesde>
				<numeroBanco xmlns="">1</numeroBanco>
				<numeroContaCorrente xmlns="">189294</numeroContaCorrente>
				<numeroDddRefer1 xmlns="">88</numeroDddRefer1>
				<numeroDddRefer2 xmlns="">88</numeroDddRefer2>
				<numeroDddTelefoneBanco xmlns="">88</numeroDddTelefoneBanco>
				<numeroMesClienteDesde xmlns="">02</numeroMesClienteDesde>
				<numeroClienteInterno xmlns="">00000001</numeroClienteInterno>
				<numeroClienteRelacional xmlns="">00000001</numeroClienteRelacional>
				<descricaoEndRefer1 xmlns="">40032001</descricaoEndRefer1>
				<descricaoEndRefer2 xmlns="">623456789</descricaoEndRefer2>
			</chamada>
		</impl:enviaPropostaFinanciamentoVeiculoPasso4Referencias>
	</soapenv:Body>
</soapenv:Envelope>
<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<dlwmin:enviaPropostaFinanciamentoVeiculoPasso4ReferenciasResponse xmlns:dlwmin="http://impl.webservice.afc.app.bsbr.altec.com/">
			<insereReferenciaResponse>
				<codigoErro></codigoErro>
				<codigoRetorno>00</codigoRetorno>
				<descricaoErro></descricaoErro>
			</insereReferenciaResponse>
		</dlwmin:enviaPropostaFinanciamentoVeiculoPasso4ReferenciasResponse>
	</soapenv:Body>
</soapenv:Envelope>
<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.webservice.afc.app.bsbr.altec.com/">
	<soapenv:Header>
		<token:security xmlns:token="http://santander-fo">
			<username xmlns="">madeireira</username>
			<key xmlns="">89564B999337A671</key>
			<cnpj xmlns="">03875890000173</cnpj>
			<codigoGrupoCanal xmlns="">0008.001</codigoGrupoCanal>
			<numeroIntermediario xmlns="">198710</numeroIntermediario>
		</token:security>
	</soapenv:Header>
	<soapenv:Body>
		<impl:enviaPropostaFinanciamentoVeiculoPasso5Garantias xmlns:impl="http://santander-fo">
			<chamada xmlns="">
				<numeroProposta xmlns="">0043204552</numeroProposta>
				<codigoGarantia xmlns="">01</codigoGarantia>
				<codigoObjFinanciado xmlns="">MO</codigoObjFinanciado>
				<descricaoModelo xmlns="">CD-130</descricaoModelo>
			</chamada>
		</impl:enviaPropostaFinanciamentoVeiculoPasso5Garantias>
	</soapenv:Body>
</soapenv:Envelope>
<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<dlwmin:enviaPropostaFinanciamentoVeiculoPasso5GarantiasResponse xmlns:dlwmin="http://impl.webservice.afc.app.bsbr.altec.com/">
			<insereGarantiaResponse>
				<codigoErro></codigoErro>
				<codigoRetorno>00</codigoRetorno>
				<descricaoErro></descricaoErro>
			</insereGarantiaResponse>
		</dlwmin:enviaPropostaFinanciamentoVeiculoPasso5GarantiasResponse>
	</soapenv:Body>
</soapenv:Envelope>
<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.webservice.afc.app.bsbr.altec.com/">
	<soapenv:Header>
		<token:security xmlns:token="http://santander-fo">
			<username xmlns="">madeireira</username>
			<key xmlns="">89564B999337A671</key>
			<cnpj xmlns="">03875890000173</cnpj>
			<codigoGrupoCanal xmlns="">0008.001</codigoGrupoCanal>
			<numeroIntermediario xmlns="">198710</numeroIntermediario>
		</token:security>
	</soapenv:Header>
	<soapenv:Body>
		<impl:enviaPropostaFinanciamentoVeiculoPasso6Fim xmlns:impl="http://santander-fo">
			<chamada xmlns="">
				<numeroPropostaAdp xmlns="">0043204552</numeroPropostaAdp>
				<numeroIntermediario xmlns="">198710</numeroIntermediario>
			</chamada>
		</impl:enviaPropostaFinanciamentoVeiculoPasso6Fim>
	</soapenv:Body>
</soapenv:Envelope>
<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<dlwmin:enviaPropostaFinanciamentoVeiculoPasso6FimResponse xmlns:dlwmin="http://impl.webservice.afc.app.bsbr.altec.com/">
			<dadosAdpResponse>
				<codigoErro></codigoErro>
				<codigoRetorno>00</codigoRetorno>
				<descricaoErro></descricaoErro>
				<dadosAdp>
					<bairroEndereco>CENTRO</bairroEndereco>
					<cepEndereco>62560000</cepEndereco>
					<cidadeEndereco>MARCO</cidadeEndereco>
					<codigoFilial>143</codigoFilial>
					<codigoIndicadorSeguro>N</codigoIndicadorSeguro>
					<codigoTipoCombustivel></codigoTipoCombustivel>
					<complementoEndereco>PROXIMO A CAGECE</complementoEndereco>
					<dataAnoModeloVeiculo>0000</dataAnoModeloVeiculo>
					<dataPrimeiroVencimento>20140625</dataPrimeiroVencimento>
					<descricaoBemFinanciado>MOVEIS CONVENCIONAIS</descricaoBemFinanciado>
					<descricaoCombustivel></descricaoCombustivel>
					<descricaoCor></descricaoCor>
					<descricaoEndereco>R PADRE CICERO 19 PROXIMO A CAGECE</descricaoEndereco>
					<descricaoMarca></descricaoMarca>
					<descricaoMensagemRetorno1>Proposta não aprovada.</descricaoMensagemRetorno1>
					<descricaoMensagemRetorno2></descricaoMensagemRetorno2>
					<descricaoModelo></descricaoModelo>
					<descricaoSeguro></descricaoSeguro>
					<fatorContraPrestacao></fatorContraPrestacao>
					<fatorVRG></fatorVRG>
					<indicadorCarteiraDetran></indicadorCarteiraDetran>
					<nomeCompleto>BRUNO ARAUJO FREITAS</nomeCompleto>
					<nomeEmpresaDespachante></nomeEmpresaDespachante>
					<nomeFornecedor>RUAH INDUSTRIA E COMERCIO DE MOVEIS LTDA</nomeFornecedor>
					<nomeSeguradora></nomeSeguradora>
					<numeroCpfCgc>00005754853378</numeroCpfCgc>
					<numeroCpfCnpjDespachante>00000000000000</numeroCpfCnpjDespachante>
					<numeroCpfCnpjFornecedor>03875890000173</numeroCpfCnpjFornecedor>
					<numeroDddTelefone>0088</numeroDddTelefone>
					<numeroDespesaDespachante>000000000000000</numeroDespesaDespachante>
					<numeroParcelaSemSeguro>036</numeroParcelaSemSeguro>
					<numeroPropostaAdp>00043204552</numeroPropostaAdp>
					<numeroStatusProposta>NA</numeroStatusProposta>
					<numeroTelefone>0088366418</numeroTelefone>
					<opcaoCompra></opcaoCompra>
					<prazoTotal>000</prazoTotal>
					<saldoOperacao></saldoOperacao>
					<ufEndereco>CE</ufEndereco>
					<valorAcessorioFina>000000000000000</valorAcessorioFina>
					<valorBaseSeguro>0000000000000</valorBaseSeguro>
					<valorCalcParc>000000000000000</valorCalcParc>
					<valorContraPrestacao>000000000027780</valorContraPrestacao>
					<valorDespesaTransporte>000000000000000</valorDespesaTransporte>
					<valorEntrada>000000001000000</valorEntrada>
					<valorGarantia></valorGarantia>
					<valorGlobalBem></valorGlobalBem>
					<valorIofAdicional>000000000000000</valorIofAdicional>
					<valorIofSemSeguro>000000000000000</valorIofSemSeguro>
					<valorIpva>000000000000000</valorIpva>
					<valorLicenciamento>000000000000000</valorLicenciamento>
					<valorMultasFina>000000000000000</valorMultasFina>
					<valorOpcaoCompra></valorOpcaoCompra>
					<valorParcelaSemSeguro>000000000027780</valorParcelaSemSeguro>
					<valorPgtoMensal>000000000000000</valorPgtoMensal>
					<valorRegOrgaoTransit>000000000000000</valorRegOrgaoTransit>
					<valorRegistroCartorio>000000000000000</valorRegistroCartorio>
					<valorResidual></valorResidual>
					<valorResidualDiluido></valorResidualDiluido>
					<valorResidualFinal></valorResidualFinal>
					<valorResidualGlobal></valorResidualGlobal>
					<valorSeguro>000000000000000</valorSeguro>
					<valorSubTotalBem>000000002000000</valorSubTotalBem>
					<valorTac>000000000000000</valorTac>
					<valorTarifaAvaliacao>0000000000000</valorTarifaAvaliacao>
					<valorTaxaAnual>000034490000</valorTaxaAnual>
					<valorTaxaCetAnualSemSeg>0003446000</valorTaxaCetAnualSemSeg>
					<valorTaxaCetMensalSemSeg>0000249000</valorTaxaCetMensalSemSeg>
					<valorTaxaIof>0150</valorTaxaIof>
					<valorTaxaMensal>000002500000</valorTaxaMensal>
					<valorTotalArrend>000000000000000</valorTotalArrend>
					<valorTotalComImposto>000000001000000</valorTotalComImposto>
					<valorTotalCprest>000000000000000</valorTotalCprest>
					<valorTotalFinalFina>000000002000080</valorTotalFinalFina>
					<valorTotalImpostoFinanc>000000000000000</valorTotalImpostoFinanc>
					<valorTotalParcIntermedi>000000000000000</valorTotalParcIntermedi>
					<valorTotalSemImposto>000000001000000</valorTotalSemImposto>
					<valorTotalTarifas>000000000000000</valorTotalTarifas>
					<valorVenda>000000002000000</valorVenda>
				</dadosAdp>
			</dadosAdpResponse>
		</dlwmin:enviaPropostaFinanciamentoVeiculoPasso6FimResponse>
	</soapenv:Body>
</soapenv:Envelope>